In [1]:
from sqlalchemy import create_engine, text
from getpass import getpass

In [2]:
# Conexión con la base de datos
DB_USER = 'postgres'
DB_PASSWORD = getpass('Ingrese la contraseña de la base de datos: ')
DB_HOST = 'localhost'
DB_PORT = '5432'
DB_NAME = 'travelixdb'

DATABASE_URL = f'postgresql://{DB_USER}:{DB_PASSWORD}@{DB_HOST}:{DB_PORT}/{DB_NAME}'
engine = create_engine(DATABASE_URL)

In [3]:
# Definir las inserciones SQL
agency_inserts = [
    "INSERT INTO agency (id, name, address, fax_number, email, photo_url) VALUES (1,'Agencia A', 'Calle 123', 111111, 'agencia_a@example.com', 'url1')",
    "INSERT INTO agency (id, name, address, fax_number, email, photo_url) VALUES (2,'Agencia B', 'Avenida Principal', 222222, 'agencia_b@example.com', 'url2')",
    "INSERT INTO agency (id, name, address, fax_number, email, photo_url) VALUES (3,'Agencia C', 'Plaza Central', 333333, 'agencia_c@example.com', 'url3')",
    "INSERT INTO agency (id, name, address, fax_number, email, photo_url) VALUES (4,'Agencia D', 'Boulevard Central', 444444, 'agencia_d@example.com', 'url4')",
    "INSERT INTO agency (id, name, address, fax_number, email, photo_url) VALUES (5,'Agencia E', 'Calle 456', 555555, 'agencia_e@example.com', 'url5')",
    "INSERT INTO agency (id, name, address, fax_number, email, photo_url) VALUES (6,'Agencia F', 'Avenida 789', 666666, 'agencia_f@example.com', 'url6')",
    "INSERT INTO agency (id, name, address, fax_number, email, photo_url) VALUES (7,'Agencia G', 'Calle 010', 777777, 'agencia_g@example.com', 'url7')",
    "INSERT INTO agency (id, name, address, fax_number, email, photo_url) VALUES (8,'Agencia H', 'Plaza X', 888888, 'agencia_h@example.com', 'url8')",
    "INSERT INTO agency (id, name, address, fax_number, email, photo_url) VALUES (9,'Agencia I', 'Boulevard Y', 999999, 'agencia_i@example.com', 'url9')",
    "INSERT INTO agency (id, name, address, fax_number, email, photo_url) VALUES (10,'Agencia J', 'Calle Z', 101010, 'agencia_j@example.com', 'url10')",
    "INSERT INTO agency (id, name, address, fax_number, email, photo_url) VALUES (11,'Agencia K', 'Avenida Z1', 1111111, 'agencia_k@example.com', 'url11')",
    "INSERT INTO agency (id, name, address, fax_number, email, photo_url) VALUES (12,'Agencia L', 'Calle 2Z', 1212121, 'agencia_l@example.com', 'url12')",
    "INSERT INTO agency (id, name, address, fax_number, email, photo_url) VALUES (13,'Agencia M', 'Plaza Z3', 1313131, 'agencia_m@example.com', 'url13')",
    "INSERT INTO agency (id, name, address, fax_number, email, photo_url) VALUES (14,'Agencia N', 'Boulevard Z4', 1414141, 'agencia_n@example.com', 'url14')",
    "INSERT INTO agency (id, name, address, fax_number, email, photo_url) VALUES (15,'Agencia O', 'Avenida Z5', 1515151, 'agencia_o@example.com', 'url15')",
    "INSERT INTO agency (id, name, address, fax_number, email, photo_url) VALUES (16,'Agencia P', 'Calle Z6', 1616161, 'agencia_p@example.com', 'url16')",
    "INSERT INTO agency (id, name, address, fax_number, email, photo_url) VALUES (17,'Agencia Q', 'Plaza Z7', 1717171, 'agencia_q@example.com', 'url17')",
    "INSERT INTO agency (id, name, address, fax_number, email, photo_url) VALUES (18,'Agencia R', 'Boulevard Z8', 1818181, 'agencia_r@example.com', 'url18')",
    "INSERT INTO agency (id, name, address, fax_number, email, photo_url) VALUES (19,'Agencia S', 'Avenida Z9', 1919191, 'agencia_s@example.com', 'url19')",
    "INSERT INTO agency (id, name, address, fax_number, email, photo_url) VALUES (20,'Agencia T', 'Calle Z10', 2020202, 'agencia_t@example.com', 'url20')",
    "INSERT INTO agency (id, name, address, fax_number, email, photo_url) VALUES (21,'Agencia U', 'Plaza Z11', 2121212, 'agencia_u@example.com', 'url21')",
    "INSERT INTO agency (id, name, address, fax_number, email, photo_url) VALUES (22,'Agencia V', 'Boulevard Z12', 2222222, 'agencia_v@example.com', 'url22')",
    "INSERT INTO agency (id, name, address, fax_number, email, photo_url) VALUES (23,'Agencia W', 'Avenida Z13', 2323232, 'agencia_w@example.com', 'url23')",
    "INSERT INTO agency (id, name, address, fax_number, email, photo_url) VALUES (24,'Agencia X', 'Calle Z14', 2424242, 'agencia_x@example.com', 'url24')",
    "INSERT INTO agency (id, name, address, fax_number, email, photo_url) VALUES (25,'Agencia Y', 'Plaza Z15', 2525252, 'agencia_y@example.com', 'url25')",
    "INSERT INTO agency (id, name, address, fax_number, email, photo_url) VALUES (26,'Agencia Z', 'Boulevard Z16', 2626262, 'agencia_z@example.com', 'url26')",
    "INSERT INTO agency (id, name, address, fax_number, email, photo_url) VALUES (27,'Agencia AA', 'Avenida Z17', 2727272, 'agencia_aa@example.com', 'url27')",
    "INSERT INTO agency (id, name, address, fax_number, email, photo_url) VALUES (28,'Agencia BB', 'Calle Z18', 2828282, 'agencia_bb@example.com', 'url28')",
    "INSERT INTO agency (id, name, address, fax_number, email, photo_url) VALUES (29,'Agencia CC', 'Plaza Z19', 2929292, 'agencia_cc@example.com', 'url29')",
    "INSERT INTO agency (id, name, address, fax_number, email, photo_url) VALUES (30,'Agencia DD', 'Boulevard Z20', 3030303, 'agencia_dd@example.com', 'url30')",
    "INSERT INTO agency (id, name, address, fax_number, email, photo_url) VALUES (31, 'Agency Thirty-One', 'Address Thirty-One', 31000, 'agency31@example.com', 'photo_url31')",
    "INSERT INTO agency (id, name, address, fax_number, email, photo_url) VALUES (32, 'Agency Thirty-Two', 'Address Thirty-Two', 32000, 'agency32@example.com', 'photo_url32')",
    "INSERT INTO agency (id, name, address, fax_number, email, photo_url) VALUES (33, 'Agency Thirty-Three', 'Address Thirty-Three', 33000, 'agency33@example.com', 'photo_url33')",
    "INSERT INTO agency (id, name, address, fax_number, email, photo_url) VALUES (34, 'Agency Thirty-Four', 'Address Thirty-Four', 34000, 'agency34@example.com', 'photo_url34')",
    "INSERT INTO agency (id, name, address, fax_number, email, photo_url) VALUES (35, 'Agency Thirty-Five', 'Address Thirty-Five', 35000, 'agency35@example.com', 'photo_url35')",
    "INSERT INTO agency (id, name, address, fax_number, email, photo_url) VALUES (36, 'Agency Thirty-Six', 'Address Thirty-Six', 36000, 'agency36@example.com', 'photo_url36')",
    "INSERT INTO agency (id, name, address, fax_number, email, photo_url) VALUES (37, 'Agency Thirty-Seven', 'Address Thirty-Seven', 37000, 'agency37@example.com', 'photo_url37')",
    "INSERT INTO agency (id, name, address, fax_number, email, photo_url) VALUES (38, 'Agency Thirty-Eight', 'Address Thirty-Eight', 38000, 'agency38@example.com', 'photo_url38')",
    "INSERT INTO agency (id, name, address, fax_number, email, photo_url) VALUES (39, 'Agency Thirty-Nine', 'Address Thirty-Nine', 39000, 'agency39@example.com', 'photo_url39')",
    "INSERT INTO agency (id, name, address, fax_number, email, photo_url) VALUES (40, 'Agency Forty', 'Address Forty', 40000, 'agency40@example.com', 'photo_url40')",
    "INSERT INTO agency (id, name, address, fax_number, email, photo_url) VALUES (41, 'Agency Forty-One', 'Address Forty-One', 41000, 'agency41@example.com', 'photo_url41')",
    "INSERT INTO agency (id, name, address, fax_number, email, photo_url) VALUES (42, 'Agency Forty-Two', 'Address Forty-Two', 42000, 'agency42@example.com', 'photo_url42')",
    "INSERT INTO agency (id, name, address, fax_number, email, photo_url) VALUES (43, 'Agency Forty-Three', 'Address Forty-Three', 43000, 'agency43@example.com', 'photo_url43')",
    "INSERT INTO agency (id, name, address, fax_number, email, photo_url) VALUES (44, 'Agency Forty-Four', 'Address Forty-Four', 44000, 'agency44@example.com', 'photo_url44')",
    "INSERT INTO agency (id, name, address, fax_number, email, photo_url) VALUES (45, 'Agency Forty-Five', 'Address Forty-Five', 45000, 'agency45@example.com', 'photo_url45')",
    "INSERT INTO agency (id, name, address, fax_number, email, photo_url) VALUES (46, 'Agency Forty-Six', 'Address Forty-Six', 46000, 'agency46@example.com', 'photo_url46')",
    "INSERT INTO agency (id, name, address, fax_number, email, photo_url) VALUES (47, 'Agency Forty-Seven', 'Address Forty-Seven', 47000, 'agency47@example.com', 'photo_url47')",
    "INSERT INTO agency (id, name, address, fax_number, email, photo_url) VALUES (48, 'Agency Forty-Eight', 'Address Forty-Eight', 48000, 'agency48@example.com', 'photo_url48')",
    "INSERT INTO agency (id, name, address, fax_number, email, photo_url) VALUES (49, 'Agency Forty-Nine', 'Address Forty-Nine', 49000, 'agency49@example.com', 'photo_url49')",
    "INSERT INTO agency (id, name, address, fax_number, email, photo_url) VALUES (50, 'Agency Fifty', 'Address Fifty', 50000, 'agency50@example.com', 'photo_url50')",
    "INSERT INTO agency (id, name, address, fax_number, email, photo_url) VALUES (51, 'Agency Fifty-One', 'Address Fifty-One', 51000, 'agency51@example.com', 'photo_url51')",
    "INSERT INTO agency (id, name, address, fax_number, email, photo_url) VALUES (52, 'Agency Fifty-Two', 'Address Fifty-Two', 52000, 'agency52@example.com', 'photo_url52')",
    "INSERT INTO agency (id, name, address, fax_number, email, photo_url) VALUES (53, 'Agency Fifty-Three', 'Address Fifty-Three', 53000, 'agency53@example.com', 'photo_url53')",
    "INSERT INTO agency (id, name, address, fax_number, email, photo_url) VALUES (54, 'Agency Fifty-Four', 'Address Fifty-Four', 54000, 'agency54@example.com', 'photo_url54')",
    "INSERT INTO agency (id, name, address, fax_number, email, photo_url) VALUES (55, 'Agency Fifty-Five', 'Address Fifty-Five', 55000, 'agency55@example.com', 'photo_url55')",
    "INSERT INTO agency (id, name, address, fax_number, email, photo_url) VALUES (56, 'Agency Fifty-Six', 'Address Fifty-Six', 56000, 'agency56@example.com', 'photo_url56')",
    "INSERT INTO agency (id, name, address, fax_number, email, photo_url) VALUES (57, 'Agency Fifty-Seven', 'Address Fifty-Seven', 57000, 'agency57@example.com', 'photo_url57')",
    "INSERT INTO agency (id, name, address, fax_number, email, photo_url) VALUES (58, 'Agency Fifty-Eight', 'Address Fifty-Eight', 58000, 'agency58@example.com', 'photo_url58')",
    "INSERT INTO agency (id, name, address, fax_number, email, photo_url) VALUES (59, 'Agency Fifty-Nine', 'Address Fifty-Nine', 59000, 'agency59@example.com', 'photo_url59')",
    "INSERT INTO agency (id, name, address, fax_number, email, photo_url) VALUES (60, 'Agency Sixty', 'Address Sixty', 60000, 'agency60@example.com', 'photo_url60')"
]

In [3]:
# Ejecutar las inserciones SQL
with engine.connect() as connection:
    for sql_insert in agency_inserts:
        connection.execute(text(sql_insert))
    # Confirmar la transacción al finalizar las inserciones
    connection.commit()

print("Se han insertado 30 registros en la tabla AgencyModel utilizando SQL.")

NameError: name 'agency_inserts' is not defined

In [4]:
excursion_inserts = [
       "INSERT INTO excursion (id, departure_day, departure_hour, departure_place, arrival_day, arrival_hour, arrival_place, price, photo_url) VALUES (1,'Lunes', '08:00:00', 'Playa A', 'Lunes', '18:00:00', 'Montaña B', 100.00, 'https://example.com/photo1.jpg')",
       "INSERT INTO excursion (id, departure_day, departure_hour, departure_place, arrival_day, arrival_hour, arrival_place, price, photo_url) VALUES (2,'Martes', '09:00:00', 'Bosque C', 'Martes', '17:00:00', 'Ciudad D', 120.00, 'https://example.com/photo2.jpg')",
       "INSERT INTO excursion (id, departure_day, departure_hour, departure_place, arrival_day, arrival_hour, arrival_place, price, photo_url) VALUES (3,'Miércoles', '10:00:00', 'Lago E', 'Miércoles', '16:00:00', 'Pueblo F', 110.00, 'https://example.com/photo3.jpg')",
       "INSERT INTO excursion (id, departure_day, departure_hour, departure_place, arrival_day, arrival_hour, arrival_place, price, photo_url) VALUES (4,'Jueves', '11:00:00', 'Cascada G', 'Jueves', '15:00:00', 'Granja H', 130.00, 'https://example.com/photo4.jpg')",
       "INSERT INTO excursion (id, departure_day, departure_hour, departure_place, arrival_day, arrival_hour, arrival_place, price, photo_url) VALUES (5,'Viernes', '12:00:00', 'Parque I', 'Viernes', '14:00:00', 'Reserva J', 90.00, 'https://example.com/photo5.jpg')",
       "INSERT INTO excursion (id, departure_day, departure_hour, departure_place, arrival_day, arrival_hour, arrival_place, price, photo_url) VALUES (6,'Sábado', '13:00:00', 'Playa K', 'Sábado', '13:00:00', 'Montaña L', 150.00, 'https://example.com/photo6.jpg')",
       "INSERT INTO excursion (id, departure_day, departure_hour, departure_place, arrival_day, arrival_hour, arrival_place, price, photo_url) VALUES (7,'Domingo', '14:00:00', 'Bosque M', 'Domingo', '12:00:00', 'Ciudad N', 95.00, 'https://example.com/photo7.jpg')",
       "INSERT INTO excursion (id, departure_day, departure_hour, departure_place, arrival_day, arrival_hour, arrival_place, price, photo_url) VALUES (8,'Lunes', '15:00:00', 'Lago O', 'Lunes', '11:00:00', 'Pueblo P', 140.00, 'https://example.com/photo8.jpg')",
       "INSERT INTO excursion (id, departure_day, departure_hour, departure_place, arrival_day, arrival_hour, arrival_place, price, photo_url) VALUES (9,'Martes', '16:00:00', 'Cascada Q', 'Martes', '10:00:00', 'Granja R', 105.00, 'https://example.com/photo9.jpg')",
       "INSERT INTO excursion (id, departure_day, departure_hour, departure_place, arrival_day, arrival_hour, arrival_place, price, photo_url) VALUES (10,'Miércoles', '17:00:00', 'Parque S', 'Miércoles', '09:00:00', 'Reserva T', 160.00, 'https://example.com/photo10.jpg')",
       "INSERT INTO excursion (id, departure_day, departure_hour, departure_place, arrival_day, arrival_hour, arrival_place, price, photo_url) VALUES (11,'Jueves', '18:00:00', 'Playa U', 'Jueves', '08:00:00', 'Montaña V', 85.00, 'https://example.com/photo11.jpg')",
       "INSERT INTO excursion (id, departure_day, departure_hour, departure_place, arrival_day, arrival_hour, arrival_place, price, photo_url) VALUES (12,'Viernes', '19:00:00', 'Bosque W', 'Viernes', '07:00:00', 'Ciudad X', 170.00, 'https://example.com/photo12.jpg')",
       "INSERT INTO excursion (id, departure_day, departure_hour, departure_place, arrival_day, arrival_hour, arrival_place, price, photo_url) VALUES (13,'Sábado', '20:00:00', 'Lago Y', 'Sábado', '06:00:00', 'Pueblo Z', 125.00, 'https://example.com/photo13.jpg')",
       "INSERT INTO excursion (id, departure_day, departure_hour, departure_place, arrival_day, arrival_hour, arrival_place, price, photo_url) VALUES (14,'Domingo', '21:00:00', 'Cascada AA', 'Domingo', '05:00:00', 'Granja BB', 180.00, 'https://example.com/photo14.jpg')",
       "INSERT INTO excursion (id, departure_day, departure_hour, departure_place, arrival_day, arrival_hour, arrival_place, price, photo_url) VALUES (15,'Lunes', '22:00:00', 'Parque CC', 'Lunes', '04:00:00', 'Reserva DD', 80.00, 'https://example.com/photo15.jpg')",
       "INSERT INTO excursion (id, departure_day, departure_hour, departure_place, arrival_day, arrival_hour, arrival_place, price, photo_url) VALUES (16,'Martes', '23:00:00', 'Playa EE', 'Martes', '03:00:00', 'Montaña FF', 190.00, 'https://example.com/photo16.jpg')",
       "INSERT INTO excursion (id, departure_day, departure_hour, departure_place, arrival_day, arrival_hour, arrival_place, price, photo_url) VALUES (17,'Miércoles', '00:00:00', 'Bosque GG', 'Miércoles', '02:00:00', 'Ciudad HH', 100.00, 'https://example.com/photo17.jpg')",
       "INSERT INTO excursion (id, departure_day, departure_hour, departure_place, arrival_day, arrival_hour, arrival_place, price, photo_url) VALUES (18,'Jueves', '01:00:00', 'Lago II', 'Jueves', '01:00:00', 'Pueblo JJ', 200.00, 'https://example.com/photo18.jpg')",
       "INSERT INTO excursion (id, departure_day, departure_hour, departure_place, arrival_day, arrival_hour, arrival_place, price, photo_url) VALUES (19,'Viernes', '02:00:00', 'Cascada KK', 'Viernes', '23:00:00', 'Granja LL', 75.00, 'https://example.com/photo19.jpg')",
       "INSERT INTO excursion (id, departure_day, departure_hour, departure_place, arrival_day, arrival_hour, arrival_place, price, photo_url) VALUES (20,'Sábado', '03:00:00', 'Parque MM', 'Sábado', '22:00:00', 'Reserva NN', 210.00, 'https://example.com/photo20.jpg')",
       "INSERT INTO excursion (id, departure_day, departure_hour, departure_place, arrival_day, arrival_hour, arrival_place, price, photo_url) VALUES (21,'Domingo', '04:00:00', 'Playa OO', 'Domingo', '21:00:00', 'Montaña PP', 110.00, 'https://example.com/photo21.jpg')",
       "INSERT INTO excursion (id, departure_day, departure_hour, departure_place, arrival_day, arrival_hour, arrival_place, price, photo_url) VALUES (22,'Lunes', '05:00:00', 'Bosque QQ', 'Lunes', '20:00:00', 'Ciudad RR', 220.00, 'https://example.com/photo22.jpg')",
       "INSERT INTO excursion (id, departure_day, departure_hour, departure_place, arrival_day, arrival_hour, arrival_place, price, photo_url) VALUES (23,'Martes', '06:00:00', 'Lago SS', 'Martes', '19:00:00', 'Pueblo TT', 95.00, 'https://example.com/photo23.jpg')",
       "INSERT INTO excursion (id, departure_day, departure_hour, departure_place, arrival_day, arrival_hour, arrival_place, price, photo_url) VALUES (24,'Miércoles', '07:00:00', 'Cascada UU', 'Miércoles', '18:00:00', 'Granja VV', 230.00, 'https://example.com/photo24.jpg')",
       "INSERT INTO excursion (id, departure_day, departure_hour, departure_place, arrival_day, arrival_hour, arrival_place, price, photo_url) VALUES (25,'Jueves', '08:00:00', 'Parque WW', 'Jueves', '17:00:00', 'Reserva XX', 105.00, 'https://example.com/photo25.jpg')",
       "INSERT INTO excursion (id, departure_day, departure_hour, departure_place, arrival_day, arrival_hour, arrival_place, price, photo_url) VALUES (26,'Viernes', '09:00:00', 'Playa YY', 'Viernes', '16:00:00', 'Montaña ZZ', 240.00, 'https://example.com/photo26.jpg')",
       "INSERT INTO excursion (id, departure_day, departure_hour, departure_place, arrival_day, arrival_hour, arrival_place, price, photo_url) VALUES (27,'Sábado', '10:00:00', 'Bosque AAA', 'Sábado', '15:00:00', 'Ciudad BBB', 125.00, 'https://example.com/photo27.jpg')",
       "INSERT INTO excursion (id, departure_day, departure_hour, departure_place, arrival_day, arrival_hour, arrival_place, price, photo_url) VALUES (28,'Domingo', '11:00:00', 'Lago CCC', 'Domingo', '14:00:00', 'Pueblo DDD', 260.00, 'https://example.com/photo28.jpg')",
       "INSERT INTO excursion (id, departure_day, departure_hour, departure_place, arrival_day, arrival_hour, arrival_place, price, photo_url) VALUES (29,'Lunes', '12:00:00', 'Cascada EEE', 'Lunes', '13:00:00', 'Granja FFF', 135.00, 'https://example.com/photo29.jpg')",
       "INSERT INTO excursion (id, departure_day, departure_hour, departure_place, arrival_day, arrival_hour, arrival_place, price, photo_url) VALUES (30,'Martes', '13:00:00', 'Parque GGG', 'Martes', '12:00:00', 'Reserva HHH', 270.00, 'https://example.com/photo30.jpg')",
       "INSERT INTO excursion (id, departure_day, departure_hour, departure_place, arrival_day, arrival_hour, arrival_place, price, photo_url) VALUES (31, 'Departure Day Thirty-One', '10:00:00', 'Departure Place Thirty-One', 'Arrival Day Thirty-One', '14:00:00', 'Arrival Place Thirty-One', 100.00, 'photo_url31')",
      "INSERT INTO excursion (id, departure_day, departure_hour, departure_place, arrival_day, arrival_hour, arrival_place, price, photo_url) VALUES (32, 'Departure Day Thirty-Two', '11:00:00', 'Departure Place Thirty-Two', 'Arrival Day Thirty-Two', '15:00:00', 'Arrival Place Thirty-Two', 150.00, 'photo_url32')",
      "INSERT INTO excursion (id, departure_day, departure_hour, departure_place, arrival_day, arrival_hour, arrival_place, price, photo_url) VALUES (33, 'Departure Day Thirty-Three', '12:00:00', 'Departure Place Thirty-Three', 'Arrival Day Thirty-Three', '16:00:00', 'Arrival Place Thirty-Three', 200.00, 'photo_url33')",
      "INSERT INTO excursion (id, departure_day, departure_hour, departure_place, arrival_day, arrival_hour, arrival_place, price, photo_url) VALUES (34, 'Departure Day Thirty-Four', '13:00:00', 'Departure Place Thirty-Four', 'Arrival Day Thirty-Four', '17:00:00', 'Arrival Place Thirty-Four', 250.00, 'photo_url34')",
      "INSERT INTO excursion (id, departure_day, departure_hour, departure_place, arrival_day, arrival_hour, arrival_place, price, photo_url) VALUES (35, 'Departure Day Thirty-Five', '14:00:00', 'Departure Place Thirty-Five', 'Arrival Day Thirty-Five', '18:00:00', 'Arrival Place Thirty-Five', 300.00, 'photo_url35')",
      "INSERT INTO excursion (id, departure_day, departure_hour, departure_place, arrival_day, arrival_hour, arrival_place, price, photo_url) VALUES (36, 'Departure Day Thirty-Six', '15:00:00', 'Departure Place Thirty-Six', 'Arrival Day Thirty-Six', '19:00:00', 'Arrival Place Thirty-Six', 350.00, 'photo_url36')",
      "INSERT INTO excursion (id, departure_day, departure_hour, departure_place, arrival_day, arrival_hour, arrival_place, price, photo_url) VALUES (37, 'Departure Day Thirty-Seven', '16:00:00', 'Departure Place Thirty-Seven', 'Arrival Day Thirty-Seven', '20:00:00', 'Arrival Place Thirty-Seven', 400.00, 'photo_url37')",
      "INSERT INTO excursion (id, departure_day, departure_hour, departure_place, arrival_day, arrival_hour, arrival_place, price, photo_url) VALUES (38, 'Departure Day Thirty-Eight', '17:00:00', 'Departure Place Thirty-Eight', 'Arrival Day Thirty-Eight', '21:00:00', 'Arrival Place Thirty-Eight', 450.00, 'photo_url38')",
      "INSERT INTO excursion (id, departure_day, departure_hour, departure_place, arrival_day, arrival_hour, arrival_place, price, photo_url) VALUES (39, 'Departure Day Thirty-Nine', '18:00:00', 'Departure Place Thirty-Nine', 'Arrival Day Thirty-Nine', '22:00:00', 'Arrival Place Thirty-Nine', 500.00, 'photo_url39')",
      "INSERT INTO excursion (id, departure_day, departure_hour, departure_place, arrival_day, arrival_hour, arrival_place, price, photo_url) VALUES (40, 'Departure Day Forty', '19:00:00', 'Departure Place Forty', 'Arrival Day Forty', '23:00:00', 'Arrival Place Forty', 550.00, 'photo_url40')",
      "INSERT INTO excursion (id, departure_day, departure_hour, departure_place, arrival_day, arrival_hour, arrival_place, price, photo_url) VALUES (41, 'Departure Day Forty-One', '20:00:00', 'Departure Place Forty-One', 'Arrival Day Forty-One', '00:00:00', 'Arrival Place Forty-One', 600.00, 'photo_url41')",
      "INSERT INTO excursion (id, departure_day, departure_hour, departure_place, arrival_day, arrival_hour, arrival_place, price, photo_url) VALUES (42, 'Departure Day Forty-Two', '21:00:00', 'Departure Place Forty-Two', 'Arrival Day Forty-Two', '01:00:00', 'Arrival Place Forty-Two', 650.00, 'photo_url42')",
      "INSERT INTO excursion (id, departure_day, departure_hour, departure_place, arrival_day, arrival_hour, arrival_place, price, photo_url) VALUES (43, 'Departure Day Forty-Three', '22:00:00', 'Departure Place Forty-Three', 'Arrival Day Forty-Three', '02:00:00', 'Arrival Place Forty-Three', 700.00, 'photo_url43')",
      "INSERT INTO excursion (id, departure_day, departure_hour, departure_place, arrival_day, arrival_hour, arrival_place, price, photo_url) VALUES (44, 'Departure Day Forty-Four', '23:00:00', 'Departure Place Forty-Four', 'Arrival Day Forty-Four', '03:00:00', 'Arrival Place Forty-Four', 750.00, 'photo_url44')",
      "INSERT INTO excursion (id, departure_day, departure_hour, departure_place, arrival_day, arrival_hour, arrival_place, price, photo_url) VALUES (45, 'Departure Day Forty-Five', '00:00:00', 'Departure Place Forty-Five', 'Arrival Day Forty-Five', '04:00:00', 'Arrival Place Forty-Five', 800.00, 'photo_url45')",
      "INSERT INTO excursion (id, departure_day, departure_hour, departure_place, arrival_day, arrival_hour, arrival_place, price, photo_url) VALUES (46, 'Departure Day Forty-Six', '01:00:00', 'Departure Place Forty-Six', 'Arrival Day Forty-Six', '05:00:00', 'Arrival Place Forty-Six', 850.00, 'photo_url46')",
      "INSERT INTO excursion (id, departure_day, departure_hour, departure_place, arrival_day, arrival_hour, arrival_place, price, photo_url) VALUES (47, 'Departure Day Forty-Seven', '02:00:00', 'Departure Place Forty-Seven', 'Arrival Day Forty-Seven', '06:00:00', 'Arrival Place Forty-Seven', 900.00, 'photo_url47')",
      "INSERT INTO excursion (id, departure_day, departure_hour, departure_place, arrival_day, arrival_hour, arrival_place, price, photo_url) VALUES (48, 'Departure Day Forty-Eight', '03:00:00', 'Departure Place Forty-Eight', 'Arrival Day Forty-Eight', '07:00:00', 'Arrival Place Forty-Eight', 950.00, 'photo_url48')",
      "INSERT INTO excursion (id, departure_day, departure_hour, departure_place, arrival_day, arrival_hour, arrival_place, price, photo_url) VALUES (49, 'Departure Day Forty-Nine', '04:00:00', 'Departure Place Forty-Nine', 'Arrival Day Forty-Nine', '08:00:00', 'Arrival Place Forty-Nine', 1000.00, 'photo_url49')",
      "INSERT INTO excursion (id, departure_day, departure_hour, departure_place, arrival_day, arrival_hour, arrival_place, price, photo_url) VALUES (50, 'Departure Day Fifty', '05:00:00', 'Departure Place Fifty', 'Arrival Day Fifty', '09:00:00', 'Arrival Place Fifty', 1050.00, 'photo_url50')",
      "INSERT INTO excursion (id, departure_day, departure_hour, departure_place, arrival_day, arrival_hour, arrival_place, price, photo_url) VALUES (51, 'Departure Day Fifty-One', '06:00:00', 'Departure Place Fifty-One', 'Arrival Day Fifty-One', '10:00:00', 'Arrival Place Fifty-One', 1100.00, 'photo_url51')",
      "INSERT INTO excursion (id, departure_day, departure_hour, departure_place, arrival_day, arrival_hour, arrival_place, price, photo_url) VALUES (52, 'Departure Day Fifty-Two', '07:00:00', 'Departure Place Fifty-Two', 'Arrival Day Fifty-Two', '11:00:00', 'Arrival Place Fifty-Two', 1150.00, 'photo_url52')",
      "INSERT INTO excursion (id, departure_day, departure_hour, departure_place, arrival_day, arrival_hour, arrival_place, price, photo_url) VALUES (53, 'Departure Day Fifty-Three', '08:00:00', 'Departure Place Fifty-Three', 'Arrival Day Fifty-Three', '12:00:00', 'Arrival Place Fifty-Three', 1200.00, 'photo_url53')",
      "INSERT INTO excursion (id, departure_day, departure_hour, departure_place, arrival_day, arrival_hour, arrival_place, price, photo_url) VALUES (54, 'Departure Day Fifty-Four', '09:00:00', 'Departure Place Fifty-Four', 'Arrival Day Fifty-Four', '13:00:00', 'Arrival Place Fifty-Four', 1250.00, 'photo_url54')",
      "INSERT INTO excursion (id, departure_day, departure_hour, departure_place, arrival_day, arrival_hour, arrival_place, price, photo_url) VALUES (55, 'Departure Day Fifty-Five', '10:00:00', 'Departure Place Fifty-Five', 'Arrival Day Fifty-Five', '14:00:00', 'Arrival Place Fifty-Five', 1300.00, 'photo_url55')",
      "INSERT INTO excursion (id, departure_day, departure_hour, departure_place, arrival_day, arrival_hour, arrival_place, price, photo_url) VALUES (56, 'Departure Day Fifty-Six', '11:00:00', 'Departure Place Fifty-Six', 'Arrival Day Fifty-Six', '15:00:00', 'Arrival Place Fifty-Six', 1350.00, 'photo_url56')",
      "INSERT INTO excursion (id, departure_day, departure_hour, departure_place, arrival_day, arrival_hour, arrival_place, price, photo_url) VALUES (57, 'Departure Day Fifty-Seven', '12:00:00', 'Departure Place Fifty-Seven', 'Arrival Day Fifty-Seven', '16:00:00', 'Arrival Place Fifty-Seven', 1400.00, 'photo_url57')",
      "INSERT INTO excursion (id, departure_day, departure_hour, departure_place, arrival_day, arrival_hour, arrival_place, price, photo_url) VALUES (58, 'Departure Day Fifty-Eight', '13:00:00', 'Departure Place Fifty-Eight', 'Arrival Day Fifty-Eight', '17:00:00', 'Arrival Place Fifty-Eight', 1450.00, 'photo_url58')",
      "INSERT INTO excursion (id, departure_day, departure_hour, departure_place, arrival_day, arrival_hour, arrival_place, price, photo_url) VALUES (59, 'Departure Day Fifty-Nine', '14:00:00', 'Departure Place Fifty-Nine', 'Arrival Day Fifty-Nine', '18:00:00', 'Arrival Place Fifty-Nine', 1500.00, 'photo_url59')",
      "INSERT INTO excursion (id, departure_day, departure_hour, departure_place, arrival_day, arrival_hour, arrival_place, price, photo_url) VALUES (60, 'Departure Day Sixty', '15:00:00', 'Departure Place Sixty', 'Arrival Day Sixty', '19:00:00', 'Arrival Place Sixty', 1550.00, 'photo_url60')"]

In [6]:
# Ejecutar las inserciones SQL
with engine.connect() as connection:
    for sql_insert in excursion_inserts:
        connection.execute(text(sql_insert))
    # Confirmar la transacción al finalizar las inserciones
    connection.commit()

print("Se han insertado 30 registros en la tabla ExcursionModel utilizando SQL.")

Se han insertado 30 registros en la tabla ExcursionModel utilizando SQL.

In [ ]:
extended_excursion_inserts = [
    "INSERT INTO extended_excursion (excursion_id) VALUES (31)",
    "INSERT INTO extended_excursion (excursion_id) VALUES (32)",
    "INSERT INTO extended_excursion (excursion_id) VALUES (33)",
    "INSERT INTO extended_excursion (excursion_id) VALUES (34)",
    "INSERT INTO extended_excursion (excursion_id) VALUES (35)",
    "INSERT INTO extended_excursion (excursion_id) VALUES (36)",
    "INSERT INTO extended_excursion (excursion_id) VALUES (37)",
    "INSERT INTO extended_excursion (excursion_id) VALUES (38)",
    "INSERT INTO extended_excursion (excursion_id) VALUES (39)",
    "INSERT INTO extended_excursion (excursion_id) VALUES (40)",
    "INSERT INTO extended_excursion (excursion_id) VALUES (41)",
    "INSERT INTO extended_excursion (excursion_id) VALUES (42)",
    "INSERT INTO extended_excursion (excursion_id) VALUES (43)",
    "INSERT INTO extended_excursion (excursion_id) VALUES (44)",
    "INSERT INTO extended_excursion (excursion_id) VALUES (45)",
    "INSERT INTO extended_excursion (excursion_id) VALUES (46)",
    "INSERT INTO extended_excursion (excursion_id) VALUES (47)",
    "INSERT INTO extended_excursion (excursion_id) VALUES (48)",
    "INSERT INTO extended_excursion (excursion_id) VALUES (49)",
    "INSERT INTO extended_excursion (excursion_id) VALUES (50)",
    "INSERT INTO extended_excursion (excursion_id) VALUES (51)",
    "INSERT INTO extended_excursion (excursion_id) VALUES (52)",
    "INSERT INTO extended_excursion (excursion_id) VALUES (53)",
    "INSERT INTO extended_excursion (excursion_id) VALUES (54)",
    "INSERT INTO extended_excursion (excursion_id) VALUES (55)",
    "INSERT INTO extended_excursion (excursion_id) VALUES (56)",
    "INSERT INTO extended_excursion (excursion_id) VALUES (57)",
    "INSERT INTO extended_excursion (excursion_id) VALUES (58)",
    "INSERT INTO extended_excursion (excursion_id) VALUES (59)",
    "INSERT INTO extended_excursion (excursion_id) VALUES (60)"
]

In [ ]:
# Ejecutar las inserciones SQL
with engine.connect() as connection:
    for sql_insert in extended_excursion_inserts:
        connection.execute(text(sql_insert))
    # Confirmar la transacción al finalizar las inserciones
    connection.commit()

print("Se han insertado 30 registros en la tabla ExtendedExcursionModel utilizando SQL.")

In [7]:
hotel_inserts = [
    "INSERT INTO hotel (id, name, address, category, photo_url) VALUES (1,'Hotel A', 'Calle 123', 3, 'https://example.com/hotel1.jpg')",
    "INSERT INTO hotel (id, name, address, category, photo_url) VALUES (2,'Hotel B', 'Avenida Principal', 4, 'https://example.com/hotel2.jpg')",
    "INSERT INTO hotel (id, name, address, category, photo_url) VALUES (3,'Hotel C', 'Plaza Central', 2, 'https://example.com/hotel3.jpg')",
    "INSERT INTO hotel (id, name, address, category, photo_url) VALUES (4,'Hotel D', 'Boulevard Central', 5, 'https://example.com/hotel4.jpg')",
    "INSERT INTO hotel (id, name, address, category, photo_url) VALUES (5,'Hotel E', 'Calle 456', 3, 'https://example.com/hotel5.jpg')",
    "INSERT INTO hotel (id, name, address, category, photo_url) VALUES (6,'Hotel F', 'Avenida 789', 4, 'https://example.com/hotel6.jpg')",
    "INSERT INTO hotel (id, name, address, category, photo_url) VALUES (7,'Hotel G', 'Calle 010', 2, 'https://example.com/hotel7.jpg')",
    "INSERT INTO hotel (id, name, address, category, photo_url) VALUES (8,'Hotel H', 'Plaza X', 5, 'https://example.com/hotel8.jpg')",
    "INSERT INTO hotel (id, name, address, category, photo_url) VALUES (9,'Hotel I', 'Boulevard Y', 3, 'https://example.com/hotel9.jpg')",
    "INSERT INTO hotel (id, name, address, category, photo_url) VALUES (10,'Hotel J', 'Calle Z', 4, 'https://example.com/hotel10.jpg')",
    "INSERT INTO hotel (id, name, address, category, photo_url) VALUES (11,'Hotel K', 'Avenida Z1', 2, 'https://example.com/hotel11.jpg')",
    "INSERT INTO hotel (id, name, address, category, photo_url) VALUES (12,'Hotel L', 'Calle 2Z', 5, 'https://example.com/hotel12.jpg')",
    "INSERT INTO hotel (id, name, address, category, photo_url) VALUES (13,'Hotel M', 'Plaza Z3', 3, 'https://example.com/hotel13.jpg')",
    "INSERT INTO hotel (id, name, address, category, photo_url) VALUES (14,'Hotel N', 'Boulevard Z4', 4, 'https://example.com/hotel14.jpg')",
    "INSERT INTO hotel (id, name, address, category, photo_url) VALUES (15,'Hotel O', 'Avenida Z5', 2, 'https://example.com/hotel15.jpg')",
    "INSERT INTO hotel (id, name, address, category, photo_url) VALUES (16,'Hotel P', 'Calle Z6', 5, 'https://example.com/hotel16.jpg')",
    "INSERT INTO hotel (id, name, address, category, photo_url) VALUES (17,'Hotel Q', 'Plaza Z7', 3, 'https://example.com/hotel17.jpg')",
    "INSERT INTO hotel (id, name, address, category, photo_url) VALUES (18,'Hotel R', 'Boulevard Z8', 4, 'https://example.com/hotel18.jpg')",
    "INSERT INTO hotel (id, name, address, category, photo_url) VALUES (19,'Hotel S', 'Avenida Z9', 2, 'https://example.com/hotel19.jpg')",
    "INSERT INTO hotel (id, name, address, category, photo_url) VALUES (20,'Hotel T', 'Calle Z10', 5, 'https://example.com/hotel20.jpg')",
    "INSERT INTO hotel (id, name, address, category, photo_url) VALUES (21,'Hotel U', 'Plaza Z11', 3, 'https://example.com/hotel21.jpg')",
    "INSERT INTO hotel (id, name, address, category, photo_url) VALUES (22,'Hotel V', 'Boulevard Z12', 4, 'https://example.com/hotel22.jpg')",
    "INSERT INTO hotel (id, name, address, category, photo_url) VALUES (23,'Hotel W', 'Avenida Z13', 2, 'https://example.com/hotel23.jpg')",
    "INSERT INTO hotel (id, name, address, category, photo_url) VALUES (24,'Hotel X', 'Calle Z14', 5, 'https://example.com/hotel24.jpg')",
    "INSERT INTO hotel (id, name, address, category, photo_url) VALUES (25,'Hotel Y', 'Plaza Z15', 3, 'https://example.com/hotel25.jpg')",
    "INSERT INTO hotel (id, name, address, category, photo_url) VALUES (26,'Hotel Z', 'Boulevard Z16', 4, 'https://example.com/hotel26.jpg')",
    "INSERT INTO hotel (id, name, address, category, photo_url) VALUES (27,'Hotel AA', 'Avenida Z17', 2, 'https://example.com/hotel27.jpg')",
    "INSERT INTO hotel (id, name, address, category, photo_url) VALUES (28,'Hotel BB', 'Calle Z18', 5, 'https://example.com/hotel28.jpg')",
    "INSERT INTO hotel (id, name, address, category, photo_url) VALUES (29,'Hotel CC', 'Plaza Z19', 3, 'https://example.com/hotel29.jpg')",
    "INSERT INTO hotel (id, name, address, category, photo_url) VALUES (30,'Hotel DD', 'Boulevard Z20', 4, 'https://example.com/hotel30.jpg')"
]

In [8]:
# Ejecutar las inserciones SQL
with engine.connect() as connection:
    for sql_insert in hotel_inserts:
        connection.execute(text(sql_insert))
    # Confirmar la transacción al finalizar las inserciones
    connection.commit()

print("Se han insertado 30 registros en la tabla HotelModel utilizando SQL.")

Se han insertado 30 registros en la tabla HotelModel utilizando SQL.

In [9]:
facility_inserts = [
    "INSERT INTO facility (id, description) VALUES (1,'Piscina olímpica')",
    "INSERT INTO facility (id, description) VALUES (2,'Gimnasio')",
    "INSERT INTO facility (id, description) VALUES (3,'Spa')",
    "INSERT INTO facility (id, description) VALUES (4,'Restaurante')",
    "INSERT INTO facility (id, description) VALUES (5,'Salón de eventos')",
    "INSERT INTO facility (id, description) VALUES (6,'Bar')",
    "INSERT INTO facility (id, description) VALUES (7,'Centro de negocios')",
    "INSERT INTO facility (id, description) VALUES (8,'Servicio de habitaciones 24 horas')",
    "INSERT INTO facility (id, description) VALUES (9,'Wifi gratuito')",
    "INSERT INTO facility (id, description) VALUES (10,'Estacionamiento')",
    "INSERT INTO facility (id, description) VALUES (11,'Recepción 24 horas')",
    "INSERT INTO facility (id, description) VALUES (12,'Consigna de equipaje')",
    "INSERT INTO facility (id, description) VALUES (13,'Servicio de lavandería')",
    "INSERT INTO facility (id, description) VALUES (14,'Caja fuerte en la habitación')",
    "INSERT INTO facility (id, description) VALUES (15,'Transporte al aeropuerto')",
    "INSERT INTO facility (id, description) VALUES (16,'Alquiler de bicicletas')",
    "INSERT INTO facility (id, description) VALUES (17,'Jardines')",
    "INSERT INTO facility (id, description) VALUES (18,'Área de juegos para niños')",
    "INSERT INTO facility (id, description) VALUES (19,'Salón de belleza')",
    "INSERT INTO facility (id, description) VALUES (20,'Jacuzzi')",
    "INSERT INTO facility (id, description) VALUES (21,'Sauna')",
    "INSERT INTO facility (id, description) VALUES (22,'Sala de juegos')",
    "INSERT INTO facility (id, description) VALUES (23,'Tienda de regalos')",
    "INSERT INTO facility (id, description) VALUES (24,'Ascensor')",
    "INSERT INTO facility (id, description) VALUES (25,'Acceso para personas con movilidad reducida')",
    "INSERT INTO facility (id, description) VALUES (26,'Servicio de despertador')",
    "INSERT INTO facility (id, description) VALUES (27,'Biblioteca')",
    "INSERT INTO facility (id, description) VALUES (28,'Mascotas permitidas')",
    "INSERT INTO facility (id, description) VALUES (29,'Guardería')",
    "INSERT INTO facility (id, description) VALUES (30,'Sala de TV compartida')"
]

In [10]:
# Ejecutar las inserciones SQL
with engine.connect() as connection:
    for sql_insert in facility_inserts:
        connection.execute(text(sql_insert))
    # Confirmar la transacción al finalizar las inserciones
    connection.commit()

print("Se han insertado 30 registros en la tabla FacilityModel utilizando SQL.")

Se han insertado 30 registros en la tabla FacilityModel utilizando SQL.

In [11]:
tourist_type_inserts = [
    "INSERT INTO tourist_type (id, name) VALUES (1,'Turista')",
    "INSERT INTO tourist_type (id, name) VALUES (2,'Aventurero')",
    "INSERT INTO tourist_type (id, name) VALUES (3,'Viajero cultural')",
    "INSERT INTO tourist_type (id, name) VALUES (4,'Mochilero')",
    "INSERT INTO tourist_type (id, name) VALUES (5,'Ecoturista')",
    "INSERT INTO tourist_type (id, name) VALUES (6,'Gastrónomo')",
    "INSERT INTO tourist_type (id, name) VALUES (7,'Relax')",
    "INSERT INTO tourist_type (id, name) VALUES (8,'Familiar')",
    "INSERT INTO tourist_type (id, name) VALUES (9,'Deportista')",
    "INSERT INTO tourist_type (id, name) VALUES (10,'Estudiante')",
    "INSERT INTO tourist_type (id, name) VALUES (11,'Negocios')",
    "INSERT INTO tourist_type (id, name) VALUES (12,'Lujo')",
    "INSERT INTO tourist_type (id, name) VALUES (13,'Aventurero extremo')",
    "INSERT INTO tourist_type (id, name) VALUES (14,'Amante de la naturaleza')",
    "INSERT INTO tourist_type (id, name) VALUES (15,'Amante de la historia')",
    "INSERT INTO tourist_type (id, name) VALUES (16,'Música y arte')",
    "INSERT INTO tourist_type (id, name) VALUES (17,'Gastronomía internacional')",
    "INSERT INTO tourist_type (id, name) VALUES (18,'Relax y spa')",
    "INSERT INTO tourist_type (id, name) VALUES (19,'Viaje en pareja')",
    "INSERT INTO tourist_type (id, name) VALUES (20,'Viaje en grupo')",
    "INSERT INTO tourist_type (id, name) VALUES (21,'Viaje en solitario')",
    "INSERT INTO tourist_type (id, name) VALUES (22,'Aventura acuática')",
    "INSERT INTO tourist_type (id, name) VALUES (23,'Aventura terrestre')",
    "INSERT INTO tourist_type (id, name) VALUES (24,'Aventura aérea')",
    "INSERT INTO tourist_type (id, name) VALUES (25,'Aventura subterránea')",
    "INSERT INTO tourist_type (id, name) VALUES (26,'Caza de auroras boreales')",
    "INSERT INTO tourist_type (id, name) VALUES (27,'Viaje de montaña')",
    "INSERT INTO tourist_type (id, name) VALUES (28,'Turismo de compras')",
    "INSERT INTO tourist_type (id, name) VALUES (29,'Turismo religioso')",
    "INSERT INTO tourist_type (id, name) VALUES (30,'Turismo de crucero')"
]

In [12]:
# Ejecutar las inserciones SQL
with engine.connect() as connection:
    for sql_insert in tourist_type_inserts:
        connection.execute(text(sql_insert))
    # Confirmar la transacción al finalizar las inserciones
    connection.commit()

print("Se han insertado 30 registros en la tabla TouristTypeModel utilizando SQL.")

Se han insertado 30 registros en la tabla TouristTypeModel utilizando SQL.

In [ ]:
offer_inserts = [
    "INSERT INTO offer (id, price, description, hotel_id) VALUES (1, 150.00, 'Oferta especial', 1)",
    "INSERT INTO offer (id, price, description, hotel_id) VALUES (2, 120.00, 'Descuento de temporada', 2)",
    "INSERT INTO offer (id, price, description, hotel_id) VALUES (3, 180.00, 'Paquete todo incluido', 3)",
    "INSERT INTO offer (id, price, description, hotel_id) VALUES (4, 200.00, 'Oferta de fin de semana', 4)",
    "INSERT INTO offer (id, price, description, hotel_id) VALUES (5, 130.00, 'Tarifa especial para parejas', 5)",
    "INSERT INTO offer (id, price, description, hotel_id) VALUES (6, 170.00, 'Promoción familiar', 6)",
    "INSERT INTO offer (id, price, description, hotel_id) VALUES (7, 140.00, 'Descuento por reserva anticipada', 7)",
    "INSERT INTO offer (id, price, description, hotel_id) VALUES (8, 160.00, 'Oferta de última hora', 8)",
    "INSERT INTO offer (id, price, description, hotel_id) VALUES (9, 190.00, 'Paquete de aniversario', 9)",
    "INSERT INTO offer (id, price, description, hotel_id) VALUES (10, 220.00, 'Oferta de luna de miel', 10)",
    "INSERT INTO offer (id, price, description, hotel_id) VALUES (11, 210.00, 'Promoción de primavera', 11)",
    "INSERT INTO offer (id, price, description, hotel_id) VALUES (12, 230.00, 'Descuento para grupos', 12)",
    "INSERT INTO offer (id, price, description, hotel_id) VALUES (13, 240.00, 'Paquete de spa', 13)",
    "INSERT INTO offer (id, price, description, hotel_id) VALUES (14, 250.00, 'Tarifa especial para deportistas', 14)",
    "INSERT INTO offer (id, price, description, hotel_id) VALUES (15, 270.00, 'Promoción de verano', 15)"
]

In [ ]:
# Ejecutar las inserciones SQL
with engine.connect() as connection:
    for sql_insert in offer_inserts:
        connection.execute(text(sql_insert))
    # Confirmar la transacción al finalizar las inserciones
    connection.commit()

print("Se han insertado 30 registros en la tabla OfferModel utilizando SQL.")

In [ ]:
tourist_inserts = [
    "INSERT INTO tourist (id, nationality) VALUES (1, 'USA')",
    "INSERT INTO tourist (id, nationality) VALUES (2, 'UK')",
    "INSERT INTO tourist (id, nationality) VALUES (3, 'Germany')",
    "INSERT INTO tourist (id, nationality) VALUES (4, 'France')",
    "INSERT INTO tourist (id, nationality) VALUES (5, 'Spain')",
    "INSERT INTO tourist (id, nationality) VALUES (6, 'Italy')",
    "INSERT INTO tourist (id, nationality) VALUES (7, 'China')",
    "INSERT INTO tourist (id, nationality) VALUES (8, 'Japan')",
    "INSERT INTO tourist (id, nationality) VALUES (9, 'Brazil')",
    "INSERT INTO tourist (id, nationality) VALUES (10, 'Canada')",
    "INSERT INTO tourist (id, nationality) VALUES (11, 'Mexico')",
    "INSERT INTO tourist (id, nationality) VALUES (12, 'Australia')",
    "INSERT INTO tourist (id, nationality) VALUES (13, 'Russia')",
    "INSERT INTO tourist (id, nationality) VALUES (14, 'India')",
    "INSERT INTO tourist (id, nationality) VALUES (15, 'South Korea')",
    "INSERT INTO tourist (id, nationality) VALUES (16, 'Netherlands')",
    "INSERT INTO tourist (id, nationality) VALUES (17, 'Sweden')",
    "INSERT INTO tourist (id, nationality) VALUES (18, 'Norway')",
    "INSERT INTO tourist (id, nationality) VALUES (19, 'Switzerland')",
    "INSERT INTO tourist (id, nationality) VALUES (20, 'Denmark')",
    "INSERT INTO tourist (id, nationality) VALUES (21, 'Austria')",
    "INSERT INTO tourist (id, nationality) VALUES (22, 'Belgium')",
    "INSERT INTO tourist (id, nationality) VALUES (23, 'Finland')",
    "INSERT INTO tourist (id, nationality) VALUES (24, 'Ireland')",
    "INSERT INTO tourist (id, nationality) VALUES (25, 'Portugal')",
    "INSERT INTO tourist (id, nationality) VALUES (26, 'Poland')",
    "INSERT INTO tourist (id, nationality) VALUES (27, 'Czech Republic')",
    "INSERT INTO tourist (id, nationality) VALUES (28, 'Turkey')",
    "INSERT INTO tourist (id, nationality) VALUES (29, 'Greece')",
    "INSERT INTO tourist (id, nationality) VALUES (30, 'South Africa')"
]

In [ ]:
# Ejecutar las inserciones SQL
with engine.connect() as connection:
    for sql_insert in tourist_inserts:
        connection.execute(text(sql_insert))
    # Confirmar la transacción al finalizar las inserciones
    connection.commit()

print("Se han insertado 30 registros en la tabla TouristModel utilizando SQL.")

In [ ]:
agent_inserts = [
    "INSERT INTO agent (id, agency_id) VALUES (31, 1)",
    "INSERT INTO agent (id, agency_id) VALUES (32, 2)",
    "INSERT INTO agent (id, agency_id) VALUES (33, 3)",
    "INSERT INTO agent (id, agency_id) VALUES (34, 4)",
    "INSERT INTO agent (id, agency_id) VALUES (35, 5)",
    "INSERT INTO agent (id, agency_id) VALUES (36, 6)",
    "INSERT INTO agent (id, agency_id) VALUES (37, 7)",
    "INSERT INTO agent (id, agency_id) VALUES (38, 8)",
    "INSERT INTO agent (id, agency_id) VALUES (39, 9)",
    "INSERT INTO agent (id, agency_id) VALUES (40, 10)",
    "INSERT INTO agent (id, agency_id) VALUES (41, 11)",
    "INSERT INTO agent (id, agency_id) VALUES (42, 12)",
    "INSERT INTO agent (id, agency_id) VALUES (43, 13)",
    "INSERT INTO agent (id, agency_id) VALUES (44, 14)",
    "INSERT INTO agent (id, agency_id) VALUES (45, 15)",
    "INSERT INTO agent (id, agency_id) VALUES (46, 16)",
    "INSERT INTO agent (id, agency_id) VALUES (47, 17)",
    "INSERT INTO agent (id, agency_id) VALUES (48, 18)",
    "INSERT INTO agent (id, agency_id) VALUES (49, 19)",
    "INSERT INTO agent (id, agency_id) VALUES (50, 20)",
    "INSERT INTO agent (id, agency_id) VALUES (51, 21)",
    "INSERT INTO agent (id, agency_id) VALUES (52, 22)",
    "INSERT INTO agent (id, agency_id) VALUES (53, 23)",
    "INSERT INTO agent (id, agency_id) VALUES (54, 24)",
    "INSERT INTO agent (id, agency_id) VALUES (55, 25)",
    "INSERT INTO agent (id, agency_id) VALUES (56, 26)",
    "INSERT INTO agent (id, agency_id) VALUES (57, 27)",
    "INSERT INTO agent (id, agency_id) VALUES (58, 28)",
    "INSERT INTO agent (id, agency_id) VALUES (59, 29)",
    "INSERT INTO agent (id, agency_id) VALUES (60, 30)"
]

In [ ]:
# Ejecutar las inserciones SQL
with engine.connect() as connection:
    for sql_insert in agent_inserts:
        connection.execute(text(sql_insert))
    # Confirmar la transacción al finalizar las inserciones
    connection.commit()

print("Se han insertado 30 registros en la tabla AgentModel utilizando SQL.")

In [ ]:
user_inserts = [
    "INSERT INTO user (id, username, name, phone, email, role, password, disabled) VALUES (1, 'user1', 'User One', '123456789', 'user1@example.com', 'tourist', 'password1', False)",
    "INSERT INTO user (id, username, name, phone, email, role, password, disabled) VALUES (2, 'user2', 'User Two', '234567890', 'user2@example.com', 'tourist', 'password2', False)",
    "INSERT INTO user (id, username, name, phone, email, role, password, disabled) VALUES (3, 'user3', 'User Three', '345678901', 'user3@example.com', 'tourist', 'password3', False)",
    "INSERT INTO user (id, username, name, phone, email, role, password, disabled) VALUES (4, 'user4', 'User Four', '456789012', 'user4@example.com', 'tourist', 'password4', False)",
    "INSERT INTO user (id, username, name, phone, email, role, password, disabled) VALUES (5, 'user5', 'User Five', '567890123', 'user5@example.com', 'tourist', 'password5', False)",
    "INSERT INTO user (id, username, name, phone, email, role, password, disabled) VALUES (6, 'user6', 'User Six', '678901234', 'user6@example.com', 'tourist', 'password6', False)",
    "INSERT INTO user (id, username, name, phone, email, role, password, disabled) VALUES (7, 'user7', 'User Seven', '789012345', 'user7@example.com', 'tourist', 'password7', False)",
    "INSERT INTO user (id, username, name, phone, email, role, password, disabled) VALUES (8, 'user8', 'User Eight', '890123456', 'user8@example.com', 'tourist', 'password8', False)",
    "INSERT INTO user (id, username, name, phone, email, role, password, disabled) VALUES (9, 'user9', 'User Nine', '901234567', 'user9@example.com', 'tourist', 'password9', False)",
    "INSERT INTO user (id, username, name, phone, email, role, password, disabled) VALUES (10, 'user10', 'User Ten', '012345678', 'user10@example.com', 'tourist', 'password10', False)",
    "INSERT INTO user (id, username, name, phone, email, role, password, disabled) VALUES (11, 'user11', 'User Eleven', '123456789', 'user11@example.com', 'tourist', 'password11', False)",
    "INSERT INTO user (id, username, name, phone, email, role, password, disabled) VALUES (12, 'user12', 'User Twelve', '234567890', 'user12@example.com', 'tourist', 'password12', False)",
    "INSERT INTO user (id, username, name, phone, email, role, password, disabled) VALUES (13, 'user13', 'User Thirteen', '345678901', 'user13@example.com', 'tourist', 'password13', False)",
    "INSERT INTO user (id, username, name, phone, email, role, password, disabled) VALUES (14, 'user14', 'User Fourteen', '456789012', 'user14@example.com', 'tourist', 'password14', False)",
    "INSERT INTO user (id, username, name, phone, email, role, password, disabled) VALUES (15, 'user15', 'User Fifteen', '567890123', 'user15@example.com', 'tourist', 'password15', False)",
    "INSERT INTO user (id, username, name, phone, email, role, password, disabled) VALUES (16, 'user16', 'User Sixteen', '678901234', 'user16@example.com', 'tourist', 'password16', False)",
    "INSERT INTO user (id, username, name, phone, email, role, password, disabled) VALUES (17, 'user17', 'User Seventeen', '789012345', 'user17@example.com', 'tourist', 'password17', False)",
    "INSERT INTO user (id, username, name, phone, email, role, password, disabled) VALUES (18, 'user18', 'User Eighteen', '890123456', 'user18@example.com', 'tourist', 'password18', False)",
    "INSERT INTO user (id, username, name, phone, email, role, password, disabled) VALUES (19, 'user19', 'User Nineteen', '901234567', 'user19@example.com', 'tourist', 'password19', False)",
    "INSERT INTO user (id, username, name, phone, email, role, password, disabled) VALUES (20, 'user20', 'User Twenty', '012345678', 'user20@example.com', 'tourist', 'password20', False)",
    "INSERT INTO user (id, username, name, phone, email, role, password, disabled) VALUES (21, 'user21', 'User Twenty-One', '123456789', 'user21@example.com', 'tourist', 'password21', False)",
    "INSERT INTO user (id, username, name, phone, email, role, password, disabled) VALUES (22, 'user22', 'User Twenty-Two', '234567890', 'user22@example.com', 'tourist', 'password22', False)",
    "INSERT INTO user (id, username, name, phone, email, role, password, disabled) VALUES (23, 'user23', 'User Twenty-Three', '345678901', 'user23@example.com', 'tourist', 'password23', False)",
    "INSERT INTO user (id, username, name, phone, email, role, password, disabled) VALUES (24, 'user24', 'User Twenty-Four', '456789012', 'user24@example.com', 'tourist', 'password24', False)",
    "INSERT INTO user (id, username, name, phone, email, role, password, disabled) VALUES (25, 'user25', 'User Twenty-Five', '567890123', 'user25@example.com', 'tourist', 'password25', False)",
    "INSERT INTO user (id, username, name, phone, email, role, password, disabled) VALUES (26, 'user26', 'User Twenty-Six', '678901234', 'user26@example.com', 'tourist', 'password26', False)",
    "INSERT INTO user (id, username, name, phone, email, role, password, disabled) VALUES (27, 'user27', 'User Twenty-Seven', '789012345', 'user27@example.com', 'tourist', 'password27', False)",
    "INSERT INTO user (id, username, name, phone, email, role, password, disabled) VALUES (28, 'user28', 'User Twenty-Eight', '890123456', 'user28@example.com', 'tourist', 'password28', False)",
    "INSERT INTO user (id, username, name, phone, email, role, password, disabled) VALUES (29, 'user29', 'User Twenty-Nine', '901234567', 'user29@example.com', 'tourist', 'password29', False)",
    "INSERT INTO user (id, username, name, phone, email, role, password, disabled) VALUES (30, 'user30', 'User Thirty', '012345678', 'user30@example.com', 'tourist', 'password30', False)"

    "INSERT INTO user (id, username, name, phone, email, role, password, disabled) VALUES (31, 'user31', 'User Thirty-One', '123456789', 'user31@example.com', 'marketing', 'password31', False)",
    "INSERT INTO user (id, username, name, phone, email, role, password, disabled) VALUES (32, 'user32', 'User Thirty-Two', '234567890', 'user32@example.com', 'marketing', 'password32', False)",
    "INSERT INTO user (id, username, name, phone, email, role, password, disabled) VALUES (33, 'user33', 'User Thirty-Three', '345678901', 'user33@example.com', 'marketing', 'password33', False)",
    "INSERT INTO user (id, username, name, phone, email, role, password, disabled) VALUES (34, 'user34', 'User Thirty-Four', '456789012', 'user34@example.com', 'marketing', 'password34', False)",
    "INSERT INTO user (id, username, name, phone, email, role, password, disabled) VALUES (35, 'user35', 'User Thirty-Five', '567890123', 'user35@example.com', 'marketing', 'password35', False)",
    "INSERT INTO user (id, username, name, phone, email, role, password, disabled) VALUES (36, 'user36', 'User Thirty-Six', '678901234', 'user36@example.com', 'marketing', 'password36', False)",
    "INSERT INTO user (id, username, name, phone, email, role, password, disabled) VALUES (37, 'user37', 'User Thirty-Seven', '789012345', 'user37@example.com', 'marketing', 'password37', False)",
    "INSERT INTO user (id, username, name, phone, email, role, password, disabled) VALUES (38, 'user38', 'User Thirty-Eight', '890123456', 'user38@example.com', 'marketing', 'password38', False)",
    "INSERT INTO user (id, username, name, phone, email, role, password, disabled) VALUES (39, 'user39', 'User Thirty-Nine', '901234567', 'user39@example.com', 'marketing', 'password39', False)",
    "INSERT INTO user (id, username, name, phone, email, role, password, disabled) VALUES (40, 'user40', 'User Forty', '012345678', 'user40@example.com', 'marketing', 'password40', False)",
    "INSERT INTO user (id, username, name, phone, email, role, password, disabled) VALUES (41, 'user41', 'User Forty-One', '123456789', 'user41@example.com', 'agent', 'password41', False)",
    "INSERT INTO user (id, username, name, phone, email, role, password, disabled) VALUES (42, 'user42', 'User Forty-Two', '234567890', 'user42@example.com', 'agent', 'password42', False)",
    "INSERT INTO user (id, username, name, phone, email, role, password, disabled) VALUES (43, 'user43', 'User Forty-Three', '345678901', 'user43@example.com', 'agent', 'password43', False)",
    "INSERT INTO user (id, username, name, phone, email, role, password, disabled) VALUES (44, 'user44', 'User Forty-Four', '456789012', 'user44@example.com', 'agent', 'password44', False)",
    "INSERT INTO user (id, username, name, phone, email, role, password, disabled) VALUES (45, 'user45', 'User Forty-Five', '567890123', 'user45@example.com', 'agent', 'password45', False)",
    "INSERT INTO user (id, username, name, phone, email, role, password, disabled) VALUES (46, 'user46', 'User Forty-Six', '678901234', 'user46@example.com', 'agent', 'password46', False)",
    "INSERT INTO user (id, username, name, phone, email, role, password, disabled) VALUES (47, 'user47', 'User Forty-Seven', '789012345', 'user47@example.com', 'agent', 'password47', False)",
    "INSERT INTO user (id, username, name, phone, email, role, password, disabled) VALUES (48, 'user48', 'User Forty-Eight', '890123456', 'user48@example.com', 'agent', 'password48', False)",
    "INSERT INTO user (id, username, name, phone, email, role, password, disabled) VALUES (49, 'user49', 'User Forty-Nine', '901234567', 'user49@example.com', 'agent', 'password49', False)",
    "INSERT INTO user (id, username, name, phone, email, role, password, disabled) VALUES (50, 'user50', 'User Fifty', '012345678', 'user50@example.com', 'agent', 'password50', False)",
    "INSERT INTO user (id, username, name, phone, email, role, password, disabled) VALUES (51, 'user51', 'User Fifty-One', '123456789', 'user51@example.com', 'marketing', 'password51', False)",
    "INSERT INTO user (id, username, name, phone, email, role, password, disabled) VALUES (52, 'user52', 'User Fifty-Two', '234567890', 'user52@example.com', 'marketing', 'password52', False)",
    "INSERT INTO user (id, username, name, phone, email, role, password, disabled) VALUES (53, 'user53', 'User Fifty-Three', '345678901', 'user53@example.com', 'marketing', 'password53', False)",
    "INSERT INTO user (id, username, name, phone, email, role, password, disabled) VALUES (54, 'user54', 'User Fifty-Four', '456789012', 'user54@example.com', 'marketing', 'password54', False)",
    "INSERT INTO user (id, username, name, phone, email, role, password, disabled) VALUES (55, 'user55', 'User Fifty-Five', '567890123', 'user55@example.com', 'marketing', 'password55', False)",
    "INSERT INTO user (id, username, name, phone, email, role, password, disabled) VALUES (56, 'user56', 'User Fifty-Six', '678901234', 'user56@example.com', 'marketing', 'password56', False)",
    "INSERT INTO user (id, username, name, phone, email, role, password, disabled) VALUES (57, 'user57', 'User Fifty-Seven', '789012345', 'user57@example.com', 'marketing', 'password57', False)",
    "INSERT INTO user (id, username, name, phone, email, role, password, disabled) VALUES (58, 'user58', 'User Fifty-Eight', '890123456', 'user58@example.com', 'marketing', 'password58', False)",
    "INSERT INTO user (id, username, name, phone, email, role, password, disabled) VALUES (59, 'user59', 'User Fifty-Nine', '901234567', 'user59@example.com', 'marketing', 'password59', False)",
    "INSERT INTO user (id, username, name, phone, email, role, password, disabled) VALUES (60, 'user60', 'User Sixty', '012345678', 'user60@example.com', 'marketing', 'password60', False)"
]

In [ ]:
# Ejecutar las inserciones SQL
with engine.connect() as connection:
    for sql_insert in user_inserts:
        connection.execute(text(sql_insert))
    # Confirmar la transacción al finalizar las inserciones
    connection.commit()

print("Se han insertado 30 registros en la tabla UserModel utilizando SQL.")

In [ ]:
agency_excursion_association_inserts = [
    "INSERT INTO agency_excursion_association (agency_id, excursion_id) VALUES (1, 1)",
    "INSERT INTO agency_excursion_association (agency_id, excursion_id) VALUES (2, 2)",
    "INSERT INTO agency_excursion_association (agency_id, excursion_id) VALUES (3, 3)",
    "INSERT INTO agency_excursion_association (agency_id, excursion_id) VALUES (4, 4)",
    "INSERT INTO agency_excursion_association (agency_id, excursion_id) VALUES (5, 5)",
    "INSERT INTO agency_excursion_association (agency_id, excursion_id) VALUES (6, 6)",
    "INSERT INTO agency_excursion_association (agency_id, excursion_id) VALUES (7, 7)",
    "INSERT INTO agency_excursion_association (agency_id, excursion_id) VALUES (8, 8)",
    "INSERT INTO agency_excursion_association (agency_id, excursion_id) VALUES (9, 9)",
    "INSERT INTO agency_excursion_association (agency_id, excursion_id) VALUES (10, 10)",
    "INSERT INTO agency_excursion_association (agency_id, excursion_id) VALUES (11, 11)",
    "INSERT INTO agency_excursion_association (agency_id, excursion_id) VALUES (12, 12)",
    "INSERT INTO agency_excursion_association (agency_id, excursion_id) VALUES (13, 13)",
    "INSERT INTO agency_excursion_association (agency_id, excursion_id) VALUES (14, 14)",
    "INSERT INTO agency_excursion_association (agency_id, excursion_id) VALUES (15, 15)"
]

In [ ]:
# Ejecutar las inserciones SQL
with engine.connect() as connection:
    for sql_insert in agency_excursion_association_inserts:
        connection.execute(text(sql_insert))
    # Confirmar la transacción al finalizar las inserciones
    connection.commit()

print("Se han insertado 30 registros en la tabla AgencyExcursionAssociationModel utilizando SQL.")

In [ ]:
agency_offer_association_inserts = [
    "INSERT INTO agency_offer_association (agency_id, offer_id, price) VALUES (1, 1, 100.00)",
    "INSERT INTO agency_offer_association (agency_id, offer_id, price) VALUES (2, 2, 110.00)",
    "INSERT INTO agency_offer_association (agency_id, offer_id, price) VALUES (3, 3, 120.00)",
    "INSERT INTO agency_offer_association (agency_id, offer_id, price) VALUES (4, 4, 130.00)",
    "INSERT INTO agency_offer_association (agency_id, offer_id, price) VALUES (5, 5, 140.00)",
    "INSERT INTO agency_offer_association (agency_id, offer_id, price) VALUES (6, 6, 150.00)",
    "INSERT INTO agency_offer_association (agency_id, offer_id, price) VALUES (7, 7, 160.00)",
    "INSERT INTO agency_offer_association (agency_id, offer_id, price) VALUES (8, 8, 170.00)",
    "INSERT INTO agency_offer_association (agency_id, offer_id, price) VALUES (9, 9, 180.00)",
    "INSERT INTO agency_offer_association (agency_id, offer_id, price) VALUES (10, 10, 190.00)",
    "INSERT INTO agency_offer_association (agency_id, offer_id, price) VALUES (11, 11, 200.00)",
    "INSERT INTO agency_offer_association (agency_id, offer_id, price) VALUES (12, 12, 210.00)",
    "INSERT INTO agency_offer_association (agency_id, offer_id, price) VALUES (13, 13, 220.00)",
    "INSERT INTO agency_offer_association (agency_id, offer_id, price) VALUES (14, 14, 230.00)",
    "INSERT INTO agency_offer_association (agency_id, offer_id, price) VALUES (15, 15, 240.00)",
    "INSERT INTO agency_offer_association (agency_id, offer_id, price) VALUES (16, 1, 250.00)",
    "INSERT INTO agency_offer_association (agency_id, offer_id, price) VALUES (17, 2, 260.00)",
    "INSERT INTO agency_offer_association (agency_id, offer_id, price) VALUES (18, 3, 270.00)",
    "INSERT INTO agency_offer_association (agency_id, offer_id, price) VALUES (19, 4, 280.00)",
    "INSERT INTO agency_offer_association (agency_id, offer_id, price) VALUES (20, 5, 290.00)",
    "INSERT INTO agency_offer_association (agency_id, offer_id, price) VALUES (21, 6, 300.00)",
    "INSERT INTO agency_offer_association (agency_id, offer_id, price) VALUES (22, 7, 310.00)",
    "INSERT INTO agency_offer_association (agency_id, offer_id, price) VALUES (23, 8, 320.00)",
    "INSERT INTO agency_offer_association (agency_id, offer_id, price) VALUES (24, 9, 330.00)",
    "INSERT INTO agency_offer_association (agency_id, offer_id, price) VALUES (25, 10, 340.00)",
    "INSERT INTO agency_offer_association (agency_id, offer_id, price) VALUES (26, 11, 350.00)",
    "INSERT INTO agency_offer_association (agency_id, offer_id, price) VALUES (27, 12, 360.00)",
    "INSERT INTO agency_offer_association (agency_id, offer_id, price) VALUES (28, 13, 370.00)",
    "INSERT INTO agency_offer_association (agency_id, offer_id, price) VALUES (29, 14, 380.00)",
    "INSERT INTO agency_offer_association (agency_id, offer_id, price) VALUES (30, 15, 390.00)"
]

In [ ]:
# Ejecutar las inserciones SQL
with engine.connect() as connection:
    for sql_insert in agency_offer_association_inserts:
        connection.execute(text(sql_insert))
    # Confirmar la transacción al finalizar las inserciones
    connection.commit()

print("Se han insertado 30 registros en la tabla AgencyOfferAssociation utilizando SQL.")

In [ ]:
excursion_reservation_inserts = [
    "INSERT INTO excursion_reservation (tourist_id, excursion_id, reservation_date, amount_of_people, air_line) VALUES (1, 1, '2024-03-25', 2, 'Airline A')",
    "INSERT INTO excursion_reservation (tourist_id, excursion_id, reservation_date, amount_of_people, air_line) VALUES (2, 2, '2024-03-26', 3, 'Airline B')",
    "INSERT INTO excursion_reservation (tourist_id, excursion_id, reservation_date, amount_of_people, air_line) VALUES (3, 3, '2024-03-27', 4, 'Airline C')",
    "INSERT INTO excursion_reservation (tourist_id, excursion_id, reservation_date, amount_of_people, air_line) VALUES (4, 4, '2024-03-28', 2, 'Airline D')",
    "INSERT INTO excursion_reservation (tourist_id, excursion_id, reservation_date, amount_of_people, air_line) VALUES (5, 5, '2024-03-29', 3, 'Airline E')",
    "INSERT INTO excursion_reservation (tourist_id, excursion_id, reservation_date, amount_of_people, air_line) VALUES (6, 6, '2024-03-30', 4, 'Airline F')",
    "INSERT INTO excursion_reservation (tourist_id, excursion_id, reservation_date, amount_of_people, air_line) VALUES (7, 7, '2024-03-31', 2, 'Airline G')",
    "INSERT INTO excursion_reservation (tourist_id, excursion_id, reservation_date, amount_of_people, air_line) VALUES (8, 8, '2024-04-01', 3, 'Airline H')",
    "INSERT INTO excursion_reservation (tourist_id, excursion_id, reservation_date, amount_of_people, air_line) VALUES (9, 9, '2024-04-02', 4, 'Airline I')",
    "INSERT INTO excursion_reservation (tourist_id, excursion_id, reservation_date, amount_of_people, air_line) VALUES (10, 10, '2024-04-03', 2, 'Airline J')",
    "INSERT INTO excursion_reservation (tourist_id, excursion_id, reservation_date, amount_of_people, air_line) VALUES (11, 11, '2024-04-04', 3, 'Airline K')",
    "INSERT INTO excursion_reservation (tourist_id, excursion_id, reservation_date, amount_of_people, air_line) VALUES (12, 12, '2024-04-05', 4, 'Airline L')",
    "INSERT INTO excursion_reservation (tourist_id, excursion_id, reservation_date, amount_of_people, air_line) VALUES (13, 13, '2024-04-06', 2, 'Airline M')",
    "INSERT INTO excursion_reservation (tourist_id, excursion_id, reservation_date, amount_of_people, air_line) VALUES (14, 14, '2024-04-07', 3, 'Airline N')",
    "INSERT INTO excursion_reservation (tourist_id, excursion_id, reservation_date, amount_of_people, air_line) VALUES (15, 15, '2024-04-08', 4, 'Airline O')"
]

In [ ]:
# Ejecutar las inserciones SQL
with engine.connect() as connection:
    for sql_insert in excursion_reservation_inserts:
        connection.execute(text(sql_insert))
    # Confirmar la transacción al finalizar las inserciones
    connection.commit()

print("Se han insertado 30 registros en la tabla ExcursionReservation utilizando SQL.")

In [ ]:
tourist_type_tourist_association_inserts = [
    "INSERT INTO tourist_type_tourist_association (tourist_type_id, tourist_id) VALUES (1, 1)",
    "INSERT INTO tourist_type_tourist_association (tourist_type_id, tourist_id) VALUES (2, 2)",
    "INSERT INTO tourist_type_tourist_association (tourist_type_id, tourist_id) VALUES (3, 3)",
    "INSERT INTO tourist_type_tourist_association (tourist_type_id, tourist_id) VALUES (4, 4)",
    "INSERT INTO tourist_type_tourist_association (tourist_type_id, tourist_id) VALUES (5, 5)",
    "INSERT INTO tourist_type_tourist_association (tourist_type_id, tourist_id) VALUES (6, 6)",
    "INSERT INTO tourist_type_tourist_association (tourist_type_id, tourist_id) VALUES (7, 7)",
    "INSERT INTO tourist_type_tourist_association (tourist_type_id, tourist_id) VALUES (8, 8)",
    "INSERT INTO tourist_type_tourist_association (tourist_type_id, tourist_id) VALUES (9, 9)",
    "INSERT INTO tourist_type_tourist_association (tourist_type_id, tourist_id) VALUES (10, 10)",
    "INSERT INTO tourist_type_tourist_association (tourist_type_id, tourist_id) VALUES (11, 11)",
    "INSERT INTO tourist_type_tourist_association (tourist_type_id, tourist_id) VALUES (12, 12)",
    "INSERT INTO tourist_type_tourist_association (tourist_type_id, tourist_id) VALUES (13, 13)",
    "INSERT INTO tourist_type_tourist_association (tourist_type_id, tourist_id) VALUES (14, 14)",
    "INSERT INTO tourist_type_tourist_association (tourist_type_id, tourist_id) VALUES (15, 15)",
    "INSERT INTO tourist_type_tourist_association (tourist_type_id, tourist_id) VALUES (16, 16)",
    "INSERT INTO tourist_type_tourist_association (tourist_type_id, tourist_id) VALUES (17, 17)",
    "INSERT INTO tourist_type_tourist_association (tourist_type_id, tourist_id) VALUES (18, 18)",
    "INSERT INTO tourist_type_tourist_association (tourist_type_id, tourist_id) VALUES (19, 19)",
    "INSERT INTO tourist_type_tourist_association (tourist_type_id, tourist_id) VALUES (20, 20)",
    "INSERT INTO tourist_type_tourist_association (tourist_type_id, tourist_id) VALUES (21, 21)",
    "INSERT INTO tourist_type_tourist_association (tourist_type_id, tourist_id) VALUES (22, 22)",
    "INSERT INTO tourist_type_tourist_association (tourist_type_id, tourist_id) VALUES (23, 23)",
    "INSERT INTO tourist_type_tourist_association (tourist_type_id, tourist_id) VALUES (24, 24)",
    "INSERT INTO tourist_type_tourist_association (tourist_type_id, tourist_id) VALUES (25, 25)",
    "INSERT INTO tourist_type_tourist_association (tourist_type_id, tourist_id) VALUES (26, 26)",
    "INSERT INTO tourist_type_tourist_association (tourist_type_id, tourist_id) VALUES (27, 27)",
    "INSERT INTO tourist_type_tourist_association (tourist_type_id, tourist_id) VALUES (28, 28)",
    "INSERT INTO tourist_type_tourist_association (tourist_type_id, tourist_id) VALUES (29, 29)",
    "INSERT INTO tourist_type_tourist_association (tourist_type_id, tourist_id) VALUES (30, 30)"
]

In [ ]:
# Ejecutar las inserciones SQL
with engine.connect() as connection:
    for sql_insert in tourist_type_tourist_association_inserts:
        connection.execute(text(sql_insert))
    # Confirmar la transacción al finalizar las inserciones
    connection.commit()

print("Se han insertado 30 registros en la tabla TouristTypeTouristAssociation utilizando SQL.")

In [ ]:
hotel_extended_excursion_association_inserts = [
    "INSERT INTO hotel_extended_excursion_association (hotel_id, extended_excursion_id, departure_date, arrival_date) VALUES (1, 31, '2024-04-01', '2024-04-03')",
    "INSERT INTO hotel_extended_excursion_association (hotel_id, extended_excursion_id, departure_date, arrival_date) VALUES (2, 32, '2024-04-02', '2024-04-04')",
    "INSERT INTO hotel_extended_excursion_association (hotel_id, extended_excursion_id, departure_date, arrival_date) VALUES (3, 33, '2024-04-03', '2024-04-05')",
    "INSERT INTO hotel_extended_excursion_association (hotel_id, extended_excursion_id, departure_date, arrival_date) VALUES (4, 34, '2024-04-04', '2024-04-06')",
    "INSERT INTO hotel_extended_excursion_association (hotel_id, extended_excursion_id, departure_date, arrival_date) VALUES (5, 35, '2024-04-05', '2024-04-07')",
    "INSERT INTO hotel_extended_excursion_association (hotel_id, extended_excursion_id, departure_date, arrival_date) VALUES (6, 36, '2024-04-06', '2024-04-08')",
    "INSERT INTO hotel_extended_excursion_association (hotel_id, extended_excursion_id, departure_date, arrival_date) VALUES (7, 37, '2024-04-07', '2024-04-09')",
    "INSERT INTO hotel_extended_excursion_association (hotel_id, extended_excursion_id, departure_date, arrival_date) VALUES (8, 38, '2024-04-08', '2024-04-10')",
    "INSERT INTO hotel_extended_excursion_association (hotel_id, extended_excursion_id, departure_date, arrival_date) VALUES (9, 39, '2024-04-09', '2024-04-11')",
    "INSERT INTO hotel_extended_excursion_association (hotel_id, extended_excursion_id, departure_date, arrival_date) VALUES (10, 40, '2024-04-10', '2024-04-12')",
    "INSERT INTO hotel_extended_excursion_association (hotel_id, extended_excursion_id, departure_date, arrival_date) VALUES (11, 41, '2024-04-11', '2024-04-13')",
    "INSERT INTO hotel_extended_excursion_association (hotel_id, extended_excursion_id, departure_date, arrival_date) VALUES (12, 42, '2024-04-12', '2024-04-14')",
    "INSERT INTO hotel_extended_excursion_association (hotel_id, extended_excursion_id, departure_date, arrival_date) VALUES (13, 43, '2024-04-13', '2024-04-15')",
    "INSERT INTO hotel_extended_excursion_association (hotel_id, extended_excursion_id, departure_date, arrival_date) VALUES (14, 44, '2024-04-14', '2024-04-16')",
    "INSERT INTO hotel_extended_excursion_association (hotel_id, extended_excursion_id, departure_date, arrival_date) VALUES (15, 45, '2024-04-15', '2024-04-17')",
    "INSERT INTO hotel_extended_excursion_association (hotel_id, extended_excursion_id, departure_date, arrival_date) VALUES (16, 46, '2024-04-16', '2024-04-18')",
    "INSERT INTO hotel_extended_excursion_association (hotel_id, extended_excursion_id, departure_date, arrival_date) VALUES (17, 47, '2024-04-17', '2024-04-19')",
    "INSERT INTO hotel_extended_excursion_association (hotel_id, extended_excursion_id, departure_date, arrival_date) VALUES (18, 48, '2024-04-18', '2024-04-20')",
    "INSERT INTO hotel_extended_excursion_association (hotel_id, extended_excursion_id, departure_date, arrival_date) VALUES (19, 49, '2024-04-19', '2024-04-21')",
    "INSERT INTO hotel_extended_excursion_association (hotel_id, extended_excursion_id, departure_date, arrival_date) VALUES (20, 50, '2024-04-20', '2024-04-22')",
    "INSERT INTO hotel_extended_excursion_association (hotel_id, extended_excursion_id, departure_date, arrival_date) VALUES (21, 51, '2024-04-21', '2024-04-23')",
    "INSERT INTO hotel_extended_excursion_association (hotel_id, extended_excursion_id, departure_date, arrival_date) VALUES (22, 52, '2024-04-22', '2024-04-24')",
    "INSERT INTO hotel_extended_excursion_association (hotel_id, extended_excursion_id, departure_date, arrival_date) VALUES (23, 53, '2024-04-23', '2024-04-25')",
    "INSERT INTO hotel_extended_excursion_association (hotel_id, extended_excursion_id, departure_date, arrival_date) VALUES (24, 54, '2024-04-24', '2024-04-26')",
    "INSERT INTO hotel_extended_excursion_association (hotel_id, extended_excursion_id, departure_date, arrival_date) VALUES (25, 55, '2024-04-25', '2024-04-27')",
    "INSERT INTO hotel_extended_excursion_association (hotel_id, extended_excursion_id, departure_date, arrival_date) VALUES (26, 56, '2024-04-26', '2024-04-28')",
    "INSERT INTO hotel_extended_excursion_association (hotel_id, extended_excursion_id, departure_date, arrival_date) VALUES (27, 57, '2024-04-27', '2024-04-29')",
    "INSERT INTO hotel_extended_excursion_association (hotel_id, extended_excursion_id, departure_date, arrival_date) VALUES (28, 58, '2024-04-28', '2024-04-30')",
    "INSERT INTO hotel_extended_excursion_association (hotel_id, extended_excursion_id, departure_date, arrival_date) VALUES (29, 59, '2024-04-29', '2024-05-01')",
    "INSERT INTO hotel_extended_excursion_association (hotel_id, extended_excursion_id, departure_date, arrival_date) VALUES (30, 60, '2024-04-30', '2024-05-02')"
]

In [ ]:
# Ejecutar las inserciones SQL
with engine.connect() as connection:
    for sql_insert in hotel_extended_excursion_association_inserts:
        connection.execute(text(sql_insert))
    # Confirmar la transacción al finalizar las inserciones
    connection.commit()

print("Se han insertado 30 registros en la tabla HotelExtendedExcursionAssociation utilizando SQL.")

In [ ]:
package_inserts = [
    "INSERT INTO package (id, agency_id, extended_excursion_id, duration, description, price, photo_url) VALUES (1, 31, 31, 3, 'Package 1', 200.0, 'photo_url1')",
    "INSERT INTO package (id, agency_id, extended_excursion_id, duration, description, price, photo_url) VALUES (2, 32, 32, 4, 'Package 2', 250.0, 'photo_url2')",
    "INSERT INTO package (id, agency_id, extended_excursion_id, duration, description, price, photo_url) VALUES (3, 33, 33, 5, 'Package 3', 300.0, 'photo_url3')",
    "INSERT INTO package (id, agency_id, extended_excursion_id, duration, description, price, photo_url) VALUES (4, 34, 34, 6, 'Package 4', 350.0, 'photo_url4')",
    "INSERT INTO package (id, agency_id, extended_excursion_id, duration, description, price, photo_url) VALUES (5, 35, 35, 7, 'Package 5', 400.0, 'photo_url5')",
    "INSERT INTO package (id, agency_id, extended_excursion_id, duration, description, price, photo_url) VALUES (6, 36, 36, 8, 'Package 6', 450.0, 'photo_url6')",
    "INSERT INTO package (id, agency_id, extended_excursion_id, duration, description, price, photo_url) VALUES (7, 37, 37, 9, 'Package 7', 500.0, 'photo_url7')",
    "INSERT INTO package (id, agency_id, extended_excursion_id, duration, description, price, photo_url) VALUES (8, 38, 38, 10, 'Package 8', 550.0, 'photo_url8')",
    "INSERT INTO package (id, agency_id, extended_excursion_id, duration, description, price, photo_url) VALUES (9, 39, 39, 11, 'Package 9', 600.0, 'photo_url9')",
    "INSERT INTO package (id, agency_id, extended_excursion_id, duration, description, price, photo_url) VALUES (10, 40, 40, 12, 'Package 10', 650.0, 'photo_url10')",
    "INSERT INTO package (id, agency_id, extended_excursion_id, duration, description, price, photo_url) VALUES (11, 41, 41, 13, 'Package 11', 700.0, 'photo_url11')",
    "INSERT INTO package (id, agency_id, extended_excursion_id, duration, description, price, photo_url) VALUES (12, 42, 42, 14, 'Package 12', 750.0, 'photo_url12')",
    "INSERT INTO package (id, agency_id, extended_excursion_id, duration, description, price, photo_url) VALUES (13, 43, 43, 15, 'Package 13', 800.0, 'photo_url13')",
    "INSERT INTO package (id, agency_id, extended_excursion_id, duration, description, price, photo_url) VALUES (14, 44, 44, 16, 'Package 14', 850.0, 'photo_url14')",
    "INSERT INTO package (id, agency_id, extended_excursion_id, duration, description, price, photo_url) VALUES (15, 45, 45, 17, 'Package 15', 900.0, 'photo_url15')"
]

In [ ]:
# Ejecutar las inserciones SQL
with engine.connect() as connection:
    for sql_insert in hotel_extended_excursion_association_inserts:
        connection.execute(text(sql_insert))
    # Confirmar la transacción al finalizar las inserciones
    connection.commit()

print("Se han insertado 30 registros en la tabla PackageModel utilizando SQL.")

In [ ]:
package_reservation_inserts = [
    "INSERT INTO package_reservation (tourist_id, package_id, reservation_date, amount_of_people, air_line) VALUES (16, 1, '2024-04-01', 2, 'Airline A')",
    "INSERT INTO package_reservation (tourist_id, package_id, reservation_date, amount_of_people, air_line) VALUES (17, 2, '2024-04-02', 1, 'Airline B')",
    "INSERT INTO package_reservation (tourist_id, package_id, reservation_date, amount_of_people, air_line) VALUES (18, 3, '2024-04-03', 3, 'Airline C')",
    "INSERT INTO package_reservation (tourist_id, package_id, reservation_date, amount_of_people, air_line) VALUES (19, 4, '2024-04-04', 2, 'Airline D')",
    "INSERT INTO package_reservation (tourist_id, package_id, reservation_date, amount_of_people, air_line) VALUES (20, 5, '2024-04-05', 1, 'Airline E')"
]

In [ ]:
# Ejecutar las inserciones SQL
with engine.connect() as connection:
    for sql_insert in package_reservation_inserts:
        connection.execute(text(sql_insert))
    # Confirmar la transacción al finalizar las inserciones
    connection.commit()

print("Se han insertado 30 registros en la tabla PackageReservation utilizando SQL.")

In [ ]:
package_facility_association_inserts = [
    "INSERT INTO package_facility_association (package_id, facility_id) VALUES (1, 1)",
    "INSERT INTO package_facility_association (package_id, facility_id) VALUES (1, 2)",
    "INSERT INTO package_facility_association (package_id, facility_id) VALUES (1, 3)",
    "INSERT INTO package_facility_association (package_id, facility_id) VALUES (1, 4)",
    "INSERT INTO package_facility_association (package_id, facility_id) VALUES (1, 5)",
    "INSERT INTO package_facility_association (package_id, facility_id) VALUES (2, 6)",
    "INSERT INTO package_facility_association (package_id, facility_id) VALUES (2, 7)",
    "INSERT INTO package_facility_association (package_id, facility_id) VALUES (2, 8)",
    "INSERT INTO package_facility_association (package_id, facility_id) VALUES (2, 9)",
    "INSERT INTO package_facility_association (package_id, facility_id) VALUES (2, 10)",
    "INSERT INTO package_facility_association (package_id, facility_id) VALUES (3, 11)",
    "INSERT INTO package_facility_association (package_id, facility_id) VALUES (3, 12)",
    "INSERT INTO package_facility_association (package_id, facility_id) VALUES (3, 13)",
    "INSERT INTO package_facility_association (package_id, facility_id) VALUES (3, 14)",
    "INSERT INTO package_facility_association (package_id, facility_id) VALUES (3, 15)",
    "INSERT INTO package_facility_association (package_id, facility_id) VALUES (4, 16)",
    "INSERT INTO package_facility_association (package_id, facility_id) VALUES (4, 17)",
    "INSERT INTO package_facility_association (package_id, facility_id) VALUES (4, 18)",
    "INSERT INTO package_facility_association (package_id, facility_id) VALUES (4, 19)",
    "INSERT INTO package_facility_association (package_id, facility_id) VALUES (4, 20)",
    "INSERT INTO package_facility_association (package_id, facility_id) VALUES (5, 21)",
    "INSERT INTO package_facility_association (package_id, facility_id) VALUES (5, 22)",
    "INSERT INTO package_facility_association (package_id, facility_id) VALUES (5, 23)",
    "INSERT INTO package_facility_association (package_id, facility_id) VALUES (5, 24)",
    "INSERT INTO package_facility_association (package_id, facility_id) VALUES (5, 25)",
    "INSERT INTO package_facility_association (package_id, facility_id) VALUES (6, 26)",
    "INSERT INTO package_facility_association (package_id, facility_id) VALUES (6, 27)",
    "INSERT INTO package_facility_association (package_id, facility_id) VALUES (6, 28)",
    "INSERT INTO package_facility_association (package_id, facility_id) VALUES (6, 29)",
    "INSERT INTO package_facility_association (package_id, facility_id) VALUES (6, 30)"
]

In [ ]:
# Ejecutar las inserciones SQL
with engine.connect() as connection:
    for sql_insert in package_facility_association_inserts:
        connection.execute(text(sql_insert))
    # Confirmar la transacción al finalizar las inserciones
    connection.commit()

print("Se han insertado 30 registros en la tabla PackageFacilityAssociation utilizando SQL.")